<img style="float: left;;" src='Figures/alinco.png' /></a>

# <center> <font color= #000047> Manipulación de Datos con la librería Pandas


<img style="float: right; margin: 0px 0px 15px 15px;" src="https://numfocus.org/wp-content/uploads/2016/07/pandas-logo-300.png" width="400px" height="400px" />

> Ya vamos agregando más librerías a nuestro arsenal. En estas clases hemos revisado aspectos muy básicos de estas librerías ([NumPy](https://www.numpy.org/) y [matplotlib](https://matplotlib.org/)). En estos enlaces pueden encontrar la documentación oficial para revisar qué más pueden hacer con estas librerías. También el `help` puede ser un buen punto de partida para conocer qué más cosas pueden realizar.


Referencias:
- https://pandas.pydata.org/
- https://towardsdatascience.com/data-science-with-python-intro-to-loading-and-subsetting-data-with-pandas-9f26895ddd7f
___

In [1]:
# Importar pandas
import pandas as pd

Los **pd.DataFrames** son los objetos por excelencia de pandas para manipular datos. Son eficientes y rápidos. Son la estructura de datos donde pandas carga los diferentes formatos de datos: cuando nuestros datos están limpios y estructurados, cada fila representa una observación, y cada columna una variable o característica. Tanto las filas como las columnas pueden tener etiquetas.

En esta clase vamos a trabajar con datos pertenecientes a ejemplos de la librería featuretools [en esta página](https://github.com/FeatureLabs/featuretools). Sin embargo para entender cómo es que se cargan estos datos, estos están disponibles en la carpeta data en formato CSV.

En esta y la siguiente clase, además de importar datos, aprenderemos a:
- seleccionar subconjuntos de datos;
- filtrar variables por categorías;
- relacionar tablas con datos complementarios;
- entre otros.

Comenzamos:

___
# 1. Importando datos

En la carpeta "data" tenemos los archivos "customers_data.csv", "sessions_data.csv", "transactions_data.csv" y "products_data.csv", cada uno de ellos conteniendo información relevante acerca de transacciones de cierta empresa.

El primer paso para comenzar a trabajar con datos es importarlos. Lo podemos hacer con la función `pd.read_csv()`:

In [8]:
# Ayuda en la función pd.read_csv()
customer = pd.read_csv('Data/customers_data.csv')
customer

   Unnamed: 0  customer_id  zip_code            join_date date_of_birth
0           0            1     60091  2011-04-17 10:48:33    1994-07-18
1           1            2     13244  2012-04-15 23:31:04    1986-08-18
2           2            3     13244  2011-08-13 15:42:34    2003-11-21
3           3            4     60091  2011-04-08 20:08:14    2006-08-15
4           4            5     60091  2010-07-17 05:27:50    1984-07-28

Muy bien, concentrémonos en los datos de cliente (comenzaremos con estos datos pequeños para ilustrar las funcionalidades, luego iremos añadiendo tamaño):

In [ ]:
# Importar customers_data.csv

Bien, ya tenemos los datos cargados, sin embargo, se ve algo raro. 

¿Qué es esta columna "Unnamed: 0"? (abrir el CSV)

Para especificar que esta columna corresponde al índice, podemos usar el argumento `index_col`.

In [ ]:
# Importar customers_data.csv, haciendo uso del argumento index_col

In [ ]:
# Tipo de lo que importamos

Ahora nuestro DataFrame luce bien. Sin embargo, podríamos querer indizar nuestro DataFrame directamente por el id de cliente, utilizando el método `set_index()`:

In [ ]:
# Usar el método set_index para indizar por el id de cliente
cusomers.set_index('customer_id', inplace

Podemos ver que pandas no convierte **customer_id** en el índice permanente del DataFrame, a menos que se lo especifiquemos. Para especificarlo, debemos usar el argumento `inplace`

In [ ]:
# Usar el método set_index para indizar por el id de cliente, usando el argumento inplace
# customers = customers.set_index("customer_id")

___
# 2. Indización y selección de datos

Hay muchas formas de las cuales podemos seleccionar datos de DataFrames. Veremos, de acuerdo al artículo al final de este documento, la forma basada en corchetes ([]) y en los métodos `loc()` y `iloc()`.

Con los corchetes, podemos seleccionar ciertas filas, o bien, ciertas columnas. 

Para una selección de filas, podemos usar el indizado como en las listas: [start_index:end_index:step], recordando que el `end_index` no es inclusivo.

Por ejemplo, seleccionar los clientes en las primeras dos filas:

In [9]:
customer[:2]

   Unnamed: 0  customer_id  zip_code            join_date date_of_birth
0           0            1     60091  2011-04-17 10:48:33    1994-07-18
1           1            2     13244  2012-04-15 23:31:04    1986-08-18

Ahora, seleccionar del tercer cliente en adelante:

In [10]:
customer[:3]

   Unnamed: 0  customer_id  zip_code            join_date date_of_birth
0           0            1     60091  2011-04-17 10:48:33    1994-07-18
1           1            2     13244  2012-04-15 23:31:04    1986-08-18
2           2            3     13244  2011-08-13 15:42:34    2003-11-21

Finalmente, seleccionar los clientes en las filas impares:

In [11]:
customer[::2]

   Unnamed: 0  customer_id  zip_code            join_date date_of_birth
0           0            1     60091  2011-04-17 10:48:33    1994-07-18
2           2            3     13244  2011-08-13 15:42:34    2003-11-21
4           4            5     60091  2010-07-17 05:27:50    1984-07-28

Similarmente, para una selección de columnas, podemos usar una lista con los nombres de las columnas requeridas. Si pasamos solo una columna como un string en lugar de una lista, el resultado será un objeto **pd.Series**:

In [12]:
# Seleccionar la columna date_of_birth como Series
customer['date_of_birth']

0    1994-07-18
1    1986-08-18
2    2003-11-21
3    2006-08-15
4    1984-07-28
Name: date_of_birth, dtype: object

In [13]:
# Tipo
type(customer['date_of_birth'])

pandas.core.series.Series

Las Series de pandas son arreglos unidimensionales que pueden ser etiquetados. En algunos casos, querremos seleccionar solo una columna pero mantener esta selección en un DataFrame. En este caso podemos pasar una lista con un solo elemento:

In [14]:
# Seleccionar la columna date_of_birth como DataFrame
customer[['date_of_birth']]

  date_of_birth
0    1994-07-18
1    1986-08-18
2    2003-11-21
3    2006-08-15
4    1984-07-28

In [15]:
# Tipo
type(customer[['date_of_birth']])

pandas.core.frame.DataFrame

Finalmente, seleccionamos dos columnas:

In [19]:
# Seleccionar las columnas date_of_birth y zip_code
#customer.loc[:,['date_of_birth', 'zip_code']]
#customer[['date_of_birth', 'zip_code']]
customer.iloc[:,[2,0]]

   zip_code  Unnamed: 0
0     60091           0
1     13244           1
2     13244           2
3     60091           3
4     60091           4

Muy bien, ya vimos que los corchetes son útiles. También existen los poderosos métodos `loc` y `iloc`, que nos dan el poder de seleccionar ambos a la vez: columnas y filas.

¿En qué se diferencian?

- El método `loc` nos permite seleccionar filas y columnas de nuestros datos basados en etoquetas. Primero, se deben especificar las etiquetas de las filas, y luego las de las columnas.

- El método `lioc` nos permite hacer lo mismo pero basado en índices enteros de nuestro DataFrame (como si fueran matrices).

Como antes, si queremos seleccionar todas las filas, o columnas, simplemente escribimos `:` en el lugar adecuado.

Mejor con ejemplos:

Para un mejor entendimiento de esta parte, reetiquetaremos la numeración de clientes con una "numeración" alfabética. Es decir: 1-A, 2-B, ..., 5-E.

In [ ]:
# Resetear índice en el lugar

In [21]:
customer.reset_index(inplace=True)
customer

,level_0,index,Unnamed: 0,customer_id,zip_code,join_date,date_of_birth
0,0,0,0,1,60091,2011-04-17 10:48:33,1994-07-18
1,1,1,1,2,13244,2012-04-15 23:31:04,1986-08-18
2,2,2,2,3,13244,2011-08-13 15:42:34,2003-11-21
3,3,3,3,4,60091,2011-04-08 20:08:14,2006-08-15
4,4,4,4,5,60091,2010-07-17 05:27:50,1984-07-28

Ahora sí.

Seleccionemos el primer cliente con ambos métodos:

In [22]:
# Primer cliente con loc
customer.index

RangeIndex(start=0, stop=5, step=1)

In [24]:
customer.index = ['A', 'B', 'C', 'D', 'E']
customer

,level_0,index,Unnamed: 0,customer_id,zip_code,join_date,date_of_birth
A,0,0,0,1,60091,2011-04-17 10:48:33,1994-07-18
B,1,1,1,2,13244,2012-04-15 23:31:04,1986-08-18
C,2,2,2,3,13244,2011-08-13 15:42:34,2003-11-21
D,3,3,3,4,60091,2011-04-08 20:08:14,2006-08-15
E,4,4,4,5,60091,2010-07-17 05:27:50,1984-07-28

In [25]:
customer.columns

Index(['level_0', 'index', 'Unnamed: 0', 'customer_id', 'zip_code',
       'join_date', 'date_of_birth'],
      dtype='object')

In [29]:
for col in customer.columns:
    print(col)

level_0
index
Unnamed: 0
customer_id
zip_code
join_date
date_of_birth

In [30]:
# Primer cliente con iloc
customer.loc['A']

level_0                            0
index                              0
Unnamed: 0                         0
customer_id                        1
zip_code                       60091
join_date        2011-04-17 10:48:33
date_of_birth             1994-07-18
Name: A, dtype: object

Nos dan series, ¿y si queremos DataFrames?

In [ ]:
# Primer cliente con loc en DataFrame

In [ ]:
# Primer cliente con iloc en DataFrame

Ahora, seleccionemos los clientes A y C con ambos métodos:

In [32]:
# Clientes A y C con loc
customer.loc[['A','C']]

,level_0,index,Unnamed: 0,customer_id,zip_code,join_date,date_of_birth
A,0,0,0,1,60091,2011-04-17 10:48:33,1994-07-18
C,2,2,2,3,13244,2011-08-13 15:42:34,2003-11-21

In [33]:
# Clientes A y C con iloc
customer.iloc[[0,2]]

,level_0,index,Unnamed: 0,customer_id,zip_code,join_date,date_of_birth
A,0,0,0,1,60091,2011-04-17 10:48:33,1994-07-18
C,2,2,2,3,13244,2011-08-13 15:42:34,2003-11-21

Ahora, de los clientes B y E, queremos su zip_code y su join_date:

In [36]:
# loc
customer.loc[['B','E'],['zip_code', 'join_date']]

   zip_code            join_date
B     13244  2012-04-15 23:31:04
E     60091  2010-07-17 05:27:50

In [39]:
# iloc
customer.iloc[[1,4],[4, 5]]

   zip_code            join_date
B     13244  2012-04-15 23:31:04
E     60091  2010-07-17 05:27:50

Ahora, queremos solo zip_code y join_date, pero de todos los clientes:

In [ ]:
# loc

In [ ]:
# iloc

¿Qué tal? Ya tenemos varias formas de seleccionar e indexar ciertos datos.

Esto es, sin duda, muy útil. Por otra parte, muchas veces queremos obtener cierta información (clientes, en nuestro ejemplo) que cumplan algunos requisitos. Por ejemplo:
- que sean mayores de 18 años, o
- que su antiguedad en la plataforma sea menor a seis meses, o
- que residan en cierta zona,
- entre otros.

Para ello utilizamos los operadores de comparación (==, >, <, >=, <=, !=).

___
# 3. Filtrado de datos

Los operadores de comparación pueden ser utilizados con Series de pandas. 

Esto resulta ser súper útil para filtrar datos con ciertas condiciones específicas (esto lo veremos enseguida). 

Por ahora, veremos que al usar operadores de comparación con Series, el resultado será Series booleanas. Es decir, cada elemento de dichas series será `True` si la condición se satisface, y `Falso` de lo contrario.

Una vez tenemos la serie boolena, podemos aplicarla para la selección de filas, obteniendo un DataFrame filtrado como resultado.

**Ejemplos**

¿Cuáles clientes son mayores de 18 años?

In [40]:
customer

,level_0,index,Unnamed: 0,customer_id,zip_code,join_date,date_of_birth
A,0,0,0,1,60091,2011-04-17 10:48:33,1994-07-18
B,1,1,1,2,13244,2012-04-15 23:31:04,1986-08-18
C,2,2,2,3,13244,2011-08-13 15:42:34,2003-11-21
D,3,3,3,4,60091,2011-04-08 20:08:14,2006-08-15
E,4,4,4,5,60091,2010-07-17 05:27:50,1984-07-28

In [42]:
type(customer.iloc[0,-1])

str

In [44]:
customer.iloc[0,-1] <= '2003-06-15'

True

In [48]:
customer.iloc[2,-1] = '2009-11-21'

In [49]:
customer.iloc[3,-1] = '2014-08-15'

In [50]:
customer['date_of_birth'] <= '2007-09-05'

A     True
B     True
C    False
D    False
E     True
Name: date_of_birth, dtype: bool

In [51]:
customer[customer['date_of_birth'] <= '2007-09-05']

,level_0,index,Unnamed: 0,customer_id,zip_code,join_date,date_of_birth
A,0,0,0,1,60091,2011-04-17 10:48:33,1994-07-18
B,1,1,1,2,13244,2012-04-15 23:31:04,1986-08-18
E,4,4,4,5,60091,2010-07-17 05:27:50,1984-07-28

In [ ]:
# Adult clients

¿Cuáles clientes se registraron después del primero de Junio del 2011?

In [53]:
# Recent joins
customer[customer['join_date'] > '2011-06-01']

,level_0,index,Unnamed: 0,customer_id,zip_code,join_date,date_of_birth
B,1,1,1,2,13244,2012-04-15 23:31:04,1986-08-18
C,2,2,2,3,13244,2011-08-13 15:42:34,2009-11-21

¿Cuáles clientes viven en la zona con CP 13244?

In [58]:
# Zone
customer[customer['zip_code'] == 13244]

,level_0,index,Unnamed: 0,customer_id,zip_code,join_date,date_of_birth
B,1,1,1,2,13244,2012-04-15 23:31:04,1986-08-18
C,2,2,2,3,13244,2011-08-13 15:42:34,2009-11-21

Entonces ya tenemos las series booleanas de las que hablábamos. Ahora, ¿cómo podemos usar esto para obtener la información de los clientes que cumplen estas características?

In [ ]:
# Filtrar por clientes adultos

In [ ]:
# Filtrar por registros recientes

In [ ]:
# Filtrar por zona

**¡Excelente!**

Los filtrados que acabamos de hacer fueron de una sola condición. Ahora, ¿cómo hacer filtrados con múltiples condiciones?

## 3.1 Filtrado con múltiples condiciones

Cuando queremos filtrar datos con múltiples condiciones, podemos usar operadores booleanos (`and`, `or`, `not`), solo con una pequeña modificación. Usamos:

- `&` en lugar de `and`,
- `|` en lugar de `or`, y
- `~` en lugar de `not`.

**Ejemplos**

Obtener la información de los clientes adultos que vivan en la zona con código postal 13244

In [62]:
customer[(customer['zip_code'] == 13244) & (customer['join_date'] <= '2007-09-05')]

Empty DataFrame
Columns: [level_0, index, Unnamed: 0, customer_id, zip_code, join_date, date_of_birth]
Index: []

Obtener la información de los clientes que sean adultos o que se hayan registrado luego del 6 de Junio del 2011

In [64]:
customer[(customer['join_date'] > '2011-06-01') | (customer['join_date'] <= '2007-09-05')]

,level_0,index,Unnamed: 0,customer_id,zip_code,join_date,date_of_birth
B,1,1,1,2,13244,2012-04-15 23:31:04,1986-08-18
C,2,2,2,3,13244,2011-08-13 15:42:34,2009-11-21

Obtener la información de los clientes que **NO** se hayan registrado en 2011

In [66]:
customer[~((customer['join_date'] >= '2011-06-01') & (customer['join_date'] <= '2011-12-31'))]

,level_0,index,Unnamed: 0,customer_id,zip_code,join_date,date_of_birth
A,0,0,0,1,60091,2011-04-17 10:48:33,1994-07-18
B,1,1,1,2,13244,2012-04-15 23:31:04,1986-08-18
D,3,3,3,4,60091,2011-04-08 20:08:14,2014-08-15
E,4,4,4,5,60091,2010-07-17 05:27:50,1984-07-28

De esta manera, podemos crear condiciones tan complejas y restrictivas como queramos para filtrar nuestros datos.

Útil, ¿no?